loadtest/ensure-failed.yml
config:
  target: 'https://artillery.io'
  phases:
    - duration: 60 # Test for 60 seconds
      arrivalRate: 20 # Incoming user: 20 users per second
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567' # Header
  ensure:
    p95: 200
    min: 20
    max: 400
    median: 200
    p99: 150
scenarios:
  - flow:
    - get:
        url: "/docs" # URL